/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
require('core'); // Ядро
const { Network } = require('..'); // Работа с сетью

/*┌────────────────────┐
  │ Создаем новую сеть │
  └────────────────────┘*/
const network = new Network({
    iface:      'eth0', // Имя интерфейса
    privateKey: '1234'  // Приватный ключ
});

/*┌─────────────────────────────────────────┐
  │ Добавляем обработчик подключения к сети │
  └─────────────────────────────────────────┘*/
network.on('connect', () => {
    _='Соединение установлено'
});

/*┌─────────────────────────────────────────┐
  │ Добавляем обработчик отключения от сети │
  └─────────────────────────────────────────┘*/
network.on('disconnect', () => {
    _='Соединение прервано'
});
