/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
require('core'); // Ядро
const Network = require('..'); // Работа с сетью

/*▄──────────────────────▄
  █                      █
  █  Создаем новую сеть  █
  █                      █
  ▀──────────────────────▀*/
const network = new Network({
// Имя интерфейса
    interface: 'eth0',
    
// Приватный ключ
    privatekey: 'AZGfyHTLAYPWWS14hLaBy8sG9hmAAiDpzEvqVZvebUpV'
});

/*▄──────────────────────────────────────────▄
  █                                          █
  █  Добавляем новую коллекцию обработчиков  █
  █                                          █
  ▀──────────────────────────────────────────▀*/
network.on = class {
/*┌────────────────────────┐
  │ Соединение установлено │
  └────────────────────────┘*/
    'online' = (request, response) => {
        _='Соединение установлено'
    }
    
/*┌─────────────────────┐
  │ Соединение прервано │
  └─────────────────────┘*/
    'offline' = (request, response) => {
        _='Соединение прервано'
    }
};
