/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
const EventEmitter = require('events');
const { Scanner, Sender } = require('l2raw'); // Работа с RAW-пакетами на уровне L2

/*▄──────────────────────▄
  █                      █
  █  Создает новую сеть  █
  █                      █
  ▀──────────────────────▀*/
module.exports = class extends EventEmitter {
/*┌────────────────────────┐
  │ Параметры по умолчанию │
  └────────────────────────┘*/
    params = {
        iface:      'eth0', // Имя интерфейса
        privateKey: '1234'  // Приватный ключ
    }
    
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(params = {}) {
    // Вызываем конструктор родителя
        super();
        
    // Сохраняем параметры с учетом значений по умолчанию
        Object.assign(this.params, params);
        
    // 123
        // ...
    }
};
